Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<Comment>Задчача №13492</Comment>
			<BasedOn>
				<xr:Item>Document.РезервированиеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоМенеджерам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Реализация/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийТабЧастиТовары

// Обработчик изменения количества в табличной части Товары
//
// Параметры:
//   Элемент - ЭлементФормы - Элемент управления, вызвавший событие
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСрока = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСумму(ТекущаяСрока);
КонецПроцедуры

// Обработчик изменения цены в табличной части Товары
//
// Параметры:
//   Элемент - ЭлементФормы - Элемент управления, вызвавший событие
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСрока = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСумму(ТекущаяСрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

// Рассчитывает сумму по количеству и цене для строки табличной части
//
// Параметры:
//   ТекущаяСтрока - ДанныеФормыЭлементКоллекции - Строка табличной части Товары
//
&НаКлиенте
Процедура РассчитатьСумму(ТекущаяСтрока)
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры 

#КонецОбласти
